#include <stdio.h>

int main ()
{
	int i , j ;

	//=================================== 正金字塔
	for (i = 0 ; i <= 5 ; i++)
	{
		for (j = 0 ; j <= 5-i ;j++)  // 打印空格 就是移动到每一行的起始位置
			printf (" "); 
		for(j=0 ; j < 2*i-1 ; j++)   // 打印显示字符
			printf ("*");
		printf ("\n"); // 换行
	}

	//==================================倒金字塔
	for (i = 4 ; i >=0 ; i--)
	{
		for (j = 0 ; j <= 5-i ;j++)  // 打印空格 就是移动到每一行的起始位置
			printf (" "); 
		for(j=0 ; j < 2*i-1 ; j++)   // 打印显示字符
			printf ("*");
		printf ("\n"); // 换行
	}

	return 0;
}